=== Trying pipe to %TEST_SERVER% --silent --domain pipe   part-0000-connect-standard.txt   part-0100-ehlo-basic.txt   part-1000-mail-basic.txt   part-1100-rcpt-basic-accept.txt   part-1100-rcpt-basic-accept.txt   part-1100-rcpt-basic-accept.txt   part-1100-rcpt-basic-accept.txt   part-2500-data-accept-basic.txt   part-3000-shutdown-accept.txt   ...
=== Connected to %TEST_SERVER% --silent --domain pipe   part-0000-connect-standard.txt   part-0100-ehlo-basic.txt   part-1000-mail-basic.txt   part-1100-rcpt-basic-accept.txt   part-1100-rcpt-basic-accept.txt   part-1100-rcpt-basic-accept.txt   part-1100-rcpt-basic-accept.txt   part-2500-data-accept-basic.txt   part-3000-shutdown-accept.txt   .
<-  220 SERVER ESMTP ready
 -> EHLO hserver
<-  250-SERVER Hello Server [1.1.1.1]
<-  250 HELP
 -> MAIL FROM:<recip@host1.nodns.test.swaks.net>
<-  250 Accepted
 -> RCPT TO:<to1@example.com>
<-  250 Accepted
 -> RCPT TO:<to2@example.com>
<-  250 Accepted
 -> RCPT TO:<bcc1@example.com>
<-  250 Accepted
 -> RCPT TO:<bcc2@example.com>
<-  250 Accepted
 -> DATA
<-  354 Enter message, ending with "." on a line by itself
 -> Date: Wed, 03 Nov 1999 11:24:29 -0500
 -> To: to1@example.com,to2@example.com
 -> From: recip@host1.nodns.test.swaks.net
 -> Subject: test Wed, 03 Nov 1999 11:24:29 -0500
 -> Message-Id: <19991103112429.047942@localhost>
 -> X-Mailer: swaks v99999999.9 jetmore.org/john/code/swaks/
 -> 
 -> This is a test mailing
 -> 
 -> 
 -> .
<-  250 OK id=fakeemail
 -> QUIT
<-  221 SERVER closing connection
=== Connection closed with child process.
