=== Trying pipe to %TEST_SERVER% --silent --domain pipe   part-0000-connect-standard.txt   part-0101-ehlo-all.txt   part-1000-mail-basic.txt   part-1100-rcpt-basic-accept.txt   part-1101-rcpt-basic-reject.txt   part-1100-rcpt-basic-accept.txt   part-2502-data-read.txt   part-0500-prdr-start.txt   part-0501-prdr-addr-accept.txt::ADDR::user1@host1.nodns.test.swaks.net   part-0501-prdr-addr-accept.txt::ADDR::user3@host1.nodns.test.swaks.net   part-2501-data-accept.txt   part-3000-shutdown-accept.txt   ...
=== Connected to %TEST_SERVER% --silent --domain pipe   part-0000-connect-standard.txt   part-0101-ehlo-all.txt   part-1000-mail-basic.txt   part-1100-rcpt-basic-accept.txt   part-1101-rcpt-basic-reject.txt   part-1100-rcpt-basic-accept.txt   part-2502-data-read.txt   part-0500-prdr-start.txt   part-0501-prdr-addr-accept.txt::ADDR::user1@host1.nodns.test.swaks.net   part-0501-prdr-addr-accept.txt::ADDR::user3@host1.nodns.test.swaks.net   part-2501-data-accept.txt   part-3000-shutdown-accept.txt   .
<-  220 SERVER ESMTP ready
 -> EHLO hserver
<-  250-SERVER Hello Server [1.1.1.1]
<-  250-STARTTLS
<-  250-PIPELINING
<-  250-XCLIENT ADDR NAME PORT PROTO DESTADDR DESTPORT HELO LOGIN REVERSE_NAME
<-  250-PRDR
<-  250-AUTH CRAM-MD5
<-  250-AUTH CRAM-SHA1
<-  250-AUTH PLAIN
<-  250-AUTH LOGIN
<-  250-AUTH NTLM
<-  250-AUTH DIGEST-MD5
<-  250-AUTH=login
<-  250 HELP
 -> MAIL FROM:<recip@host1.nodns.test.swaks.net> PRDR
<-  250 Accepted
 -> RCPT TO:<user1@host1.nodns.test.swaks.net>
<-  250 Accepted
 -> RCPT TO:<user2@host1.nodns.test.swaks.net>
<** 550 rejected
 -> RCPT TO:<user3@host1.nodns.test.swaks.net>
<-  250 Accepted
 -> DATA
<-  354 Enter message, ending with "." on a line by itself
 -> Date: Wed, 03 Nov 1999 11:24:29 -0500
 -> To: user1@host1.nodns.test.swaks.net,user2@host1.nodns.test.swaks.net,user3@host1.nodns.test.swaks.net
 -> From: recip@host1.nodns.test.swaks.net
 -> Subject: test Wed, 03 Nov 1999 11:24:29 -0500
 -> Message-Id: <19991103112429.047942@localhost>
 -> X-Mailer: swaks v99999999.9 jetmore.org/john/code/swaks/
 -> 
 -> This is a test mailing
 -> 
 -> 
 -> .
<-  353 PRDR content analysis beginning
<-  250 PRDR R=<user1@host1.nodns.test.swaks.net> acceptance
<-  250 PRDR R=<user3@host1.nodns.test.swaks.net> acceptance
<-  250 OK id=fakeemail
 -> QUIT
<-  221 SERVER closing connection
=== Connection closed with child process.
